# Getting To Know Your Data

###  Use the u.user file and assign it to a dataframe

In [1]:
import pandas as pd 
# Read data from file 'filename.csv' 
# (in the same directory that your python process is based)
# Control delimiters, rows, column names with read_csv (see later) 
user_df = pd.read_csv("u.user",delimiter='|')

###  See the first 5 entries

In [2]:
# Preview the first 5 lines of the loaded data 
user_df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

 ###  What is the number of observations in the dataset?

In [3]:
user_df.count()
#or user_df.shape[0]

user_id       943
age           943
gender        943
occupation    943
zip_code      943
dtype: int64

 ### What is the number of columns in the dataset?

In [4]:
user_df.shape[1]

5

### Print the name of all the columns.

In [5]:
user_df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### How is the dataset indexed?

In [6]:
user_df.index

RangeIndex(start=0, stop=943, step=1)

### What is datatype of each cloumn?

In [7]:
user_df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

###  How many different occupation are in this dataset?

In [8]:
user_df.nunique(axis=0)['occupation']

21

### What is the most frequent occupation?

In [9]:
user_df['occupation'].value_counts().idxmax()

'student'

### Summarize the DataFrame.

In [10]:
user_df.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### Summarize all the columns

In [11]:
user_df.describe( include='all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

### Summarize only the occupation column

In [12]:
user_df['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### What is the age with least occurrence?

In [13]:
user_df['age'].value_counts().idxmin()

#they're quite many. How do we extract all of them?

11

# Load Json file

## read a raw_nyc_phil.json data

In [14]:
json_df = pd.read_json('raw_nyc_phil.json', dtype="utf-8")
json_df

                                                programs
0      {'season': '1842-43', 'orchestra': 'New York P...
1      {'season': '1842-43', 'orchestra': 'New York P...
2      {'season': '1842-43', 'orchestra': 'Musicians ...
3      {'season': '1842-43', 'orchestra': 'New York P...
4      {'season': '1843-44', 'orchestra': 'New York P...
...                                                  ...
13949  {'season': '2016-17', 'orchestra': 'Musicians ...
13950  {'season': '2016-17', 'orchestra': 'New York P...
13951  {'season': '2016-17', 'orchestra': 'New York P...
13952  {'season': '2016-17', 'orchestra': 'New York P...
13953  {'season': '2016-17', 'orchestra': 'New York P...

[13954 rows x 1 columns]

## Normalize a json data so that you get an output with columns

Date 	eventType 	Venue 	Location 	Time 	id 	orchestra 	programID 	season

In [15]:
from pandas.io.json import json_normalize

Target_df = pd.json_normalize(data=json_df['programs'], record_path = ['concerts'], meta=[ 'id', 'orchestra', 'programID', 'season'])
Target_df

,Date,eventType,Venue,Location,Time,id,orchestra,programID,season
0,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,38e072a7-8fc9-4f9a-8eac-3957905c0002,New York Philharmonic,3853,1842-43
1,1843-02-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,c7b2b95c-5e0b-431c-a340-5b37fc860b34,New York Philharmonic,5178,1842-43
2,1843-04-07T05:00:00Z,Special,Apollo Rooms,"Manhattan, NY",8:00PM,894e1a52-1ae5-4fa7-aec0-b99997555a37,Musicians from the New York Philharmonic,10785,1842-43
3,1843-04-22T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,34ec2c2b-3297-4716-9831-b538310462b7,New York Philharmonic,5887,1842-43
4,1843-11-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",None,610a4acc-94e4-4cd6-bdc1-8ad020edc7e9,New York Philharmonic,305,1843-44
...,...,...,...,...,...,...,...,...,...
21602,2017-06-24T04:00:00Z,Chamber,Guild Hall,"East Hampton, NY",None,3d50968c-2e8b-405f-969c-ba36f941f393,Musicians from the New York Philharmonic,14189,2016-17
21603,2017-07-02T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM,adb9fc8b-95bc-47d0-9f4b-78fc242f1f8f,New York Philharmonic,14146,2016-17
21604,2017-07-03T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM,f072c652-c452-4ad4-975a-f6abd5ff8b4d,New York Philharmonic,14148,2016-17
21605,2017-07-04T04:00:00Z,Tour - Young People's Concert,Shanghai Symphony Hall--Chamber Hall,"Shanghai, CHINA",7:30PM,68625626-8085-44e4-bdb3-d8e6ac51c95b,New York Philharmonic,14136,2016-17
21606,2017-07-07T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM,5c22d35f-a282-4505-bd31-df619c74f52b,New York Philharmonic,14147,2016-17

## Normalize a json data to get an output with columns :

soloistName 	soloistRoles 	soloistInstrument 	id

In [16]:
Target_df_s = pd.json_normalize(data=json_df['programs'],record_path = ['works','soloists'], meta='id')
Target_df_s

,soloistName,soloistRoles,soloistInstrument,id
0,"Otto, Antoinette",S,Soprano,38e072a7-8fc9-4f9a-8eac-3957905c0002
1,"Scharfenberg, William",A,Piano,38e072a7-8fc9-4f9a-8eac-3957905c0002
2,"Hill, Ureli Corelli",A,Violin,38e072a7-8fc9-4f9a-8eac-3957905c0002
3,"Derwort, G. H.",A,Viola,38e072a7-8fc9-4f9a-8eac-3957905c0002
4,"Boucher, Alfred",A,Cello,38e072a7-8fc9-4f9a-8eac-3957905c0002
...,...,...,...,...
56189,"Xu, Weiqin",S,Baritone,68625626-8085-44e4-bdb3-d8e6ac51c95b
56190,"Martin, Christopher",S,Trumpet,5c22d35f-a282-4505-bd31-df619c74f52b
56191,"Shryock, Grace",S,English Horn,5c22d35f-a282-4505-bd31-df619c74f52b
56192,Jazz at Lincoln Center Orchestra with Wynton M...,S,Jazz Ensemble,5c22d35f-a282-4505-bd31-df619c74f52b
56193,Jazz at Lincoln Center Orchestra with Wynton M...,S,Jazz Ensemble,5c22d35f-a282-4505-bd31-df619c74f52b

## Normalize a json to get an output with columns
soloistName 	soloistRoles 	soloistInstrument 	id 	orchestra 	programID 	season 	 	Date 	eventType 	Venue 	Location 	Time

In [17]:
Target_df_s_1 = pd.json_normalize(data=json_df['programs'],record_path = ['works','soloists'], meta=[ 'id', 'orchestra', 'programID', 'season'],)
Target_df_s_2 = pd.json_normalize(data=json_df['programs'], record_path = ['concerts'])
Target_df_s_3=pd.concat([Target_df_s_1, Target_df_s_2])
Target_df_s_3

,soloistName,soloistRoles,soloistInstrument,id,orchestra,programID,season,Date,eventType,Venue,Location,Time
0,"Otto, Antoinette",S,Soprano,38e072a7-8fc9-4f9a-8eac-3957905c0002,New York Philharmonic,3853,1842-43,NaN,NaN,NaN,NaN,NaN
1,"Scharfenberg, William",A,Piano,38e072a7-8fc9-4f9a-8eac-3957905c0002,New York Philharmonic,3853,1842-43,NaN,NaN,NaN,NaN,NaN
2,"Hill, Ureli Corelli",A,Violin,38e072a7-8fc9-4f9a-8eac-3957905c0002,New York Philharmonic,3853,1842-43,NaN,NaN,NaN,NaN,NaN
3,"Derwort, G. H.",A,Viola,38e072a7-8fc9-4f9a-8eac-3957905c0002,New York Philharmonic,3853,1842-43,NaN,NaN,NaN,NaN,NaN
4,"Boucher, Alfred",A,Cello,38e072a7-8fc9-4f9a-8eac-3957905c0002,New York Philharmonic,3853,1842-43,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
21602,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017-06-24T04:00:00Z,Chamber,Guild Hall,"East Hampton, NY",None
21603,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017-07-02T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM
21604,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017-07-03T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM
21605,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017-07-04T04:00:00Z,Tour - Young People's Concert,Shanghai Symphony Hall--Chamber Hall,"Shanghai, CHINA",7:30PM
21606,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017-07-07T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM